[Killed] StringLiteral
services/order.js:5:25
 import Order from '../models/Order.js';
 import Dish from '../models/Dish.js';
 
-const defaultEmployee = 'E101';
+const defaultEmployee = "";
 
 const getAllHistory = async () => {
killedBy: Order API & Service Integration Tests POST /api/orders (Create) should create an order successfully and calculate total price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
services/order.js:7:35
 
 const defaultEmployee = 'E101';
 
-const getAllHistory = async () => {
-  try {
-    return await Order.find()
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
-  } catch (error) {
-    console.error('Помилка у сервісі getAllHistory:', error);
-    throw new Error('Не вдалося отримати історію замовлень');
-  }
-};
+const getAllHistory = async () => {};
 
 const getPopularDishes = async () => {
killedBy: Order Service Unit Tests getAllHistory повинен повернути історію замовлень
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
services/order.js:8:7
 const defaultEmployee = 'E101';
 
 const getAllHistory = async () => {
-  try {
-    return await Order.find()
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
-  } catch (error) {
+  try {} catch (error) {
     console.error('Помилка у сервісі getAllHistory:', error);
     throw new Error('Не вдалося отримати історію замовлень');
killedBy: Order Service Unit Tests getAllHistory повинен повернути історію замовлень
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] MethodExpression
services/order.js:9:18
 
 const getAllHistory = async () => {
   try {
-    return await Order.find()
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
+    return await Order.find().populate('items.menu_id', 'dishName price');
   } catch (error) {
     console.error('Помилка у сервісі getAllHistory:', error);

[Timeout] UnaryOperator
services/order.js:11:26
   try {
     return await Order.find()
       .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
   } catch (error) {
     console.error('Помилка у сервісі getAllHistory:', error);

[Timeout] BlockStatement
services/order.js:12:19
     return await Order.find()
       .populate('items.menu_id', 'dishName price')
       .sort({ createdAt: -1 });
-  } catch (error) {
-    console.error('Помилка у сервісі getAllHistory:', error);
-    throw new Error('Не вдалося отримати історію замовлень');
-  }
+  } catch (error) {}
 };
 

[Killed] ObjectLiteral
services/order.js:21:7
 const getPopularDishes = async () => {
   try {
     return await Order.aggregate([
-      { $unwind: '$items' },
+      {},
       {
         $group: {
killedBy: Order API & Service Integration Tests Statistics & History should correctly calculate popular dishes based on quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] StringLiteral
services/order.js:21:18
 const getPopularDishes = async () => {
   try {
     return await Order.aggregate([
-      { $unwind: '$items' },
+      { $unwind: "" },
       {
         $group: {
killedBy: Order API & Service Integration Tests Statistics & History should correctly calculate popular dishes based on quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
services/order.js:23:17
     return await Order.aggregate([
       { $unwind: '$items' },
       {
-        $group: {
-          _id: '$items.menu_id',
-          totalQuantity: { $sum: '$items.quantity' },
-        },
+        $group: {},
       },
       { $sort: { totalQuantity: -1 } },
killedBy: Order API & Service Integration Tests Statistics & History should correctly calculate popular dishes based on quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
services/order.js:25:26
       {
         $group: {
           _id: '$items.menu_id',
-          totalQuantity: { $sum: '$items.quantity' },
+          totalQuantity: {},
         },
       },
killedBy: Order API & Service Integration Tests Statistics & History should correctly calculate popular dishes based on quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] StringLiteral
services/order.js:25:34
       {
         $group: {
           _id: '$items.menu_id',
-          totalQuantity: { $sum: '$items.quantity' },
+          totalQuantity: { $sum: "" },
         },
       },

[Timeout] UnaryOperator
services/order.js:28:33
           totalQuantity: { $sum: '$items.quantity' },
         },
       },
-      { $sort: { totalQuantity: -1 } },
+      { $sort: { totalQuantity: +1 } },
       {
         $lookup: {

[Timeout] ObjectLiteral
services/order.js:28:16
           totalQuantity: { $sum: '$items.quantity' },
         },
       },
-      { $sort: { totalQuantity: -1 } },
+      { $sort: {} },
       {
         $lookup: {

[Timeout] ObjectLiteral
services/order.js:29:7
         },
       },
       { $sort: { totalQuantity: -1 } },
-      {
-        $lookup: {
-          from: 'dishes',
-          localField: '_id',
-          foreignField: '_id',
-          as: 'dishDetails',
-        },
-      },
+      {},
       { $unwind: '$dishDetails' },
       {

[Timeout] StringLiteral
services/order.js:34:15
           from: 'dishes',
           localField: '_id',
           foreignField: '_id',
-          as: 'dishDetails',
+          as: "",
         },
       },

[Timeout] StringLiteral
services/order.js:41:20
       {
         $project: {
           _id: 0,
-          menu_id: '$_id',
+          menu_id: "",
           dishName: '$dishDetails.dishName',
           totalQuantity: '$totalQuantity',

[Timeout] BlockStatement
services/order.js:47:19
         },
       },
     ]);
-  } catch (error) {
-    console.error('Помилка у сервісі getPopularDishes:', error);
-    throw new Error('Не вдалося розрахувати популярні страви');
-  }
+  } catch (error) {}
 };
 

[Timeout] BlockStatement
services/order.js:53:40
   }
 };
 
-const getAllActiveOrders = async () => {
-  try {
-    return await Order.find({ status: 'active' })
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
-  } catch (error) {
-    console.error('Помилка у сервісі getAllActiveOrders:', error);
-    throw new Error('Не вдалося отримати активні замовлення');
-  }
-};
+const getAllActiveOrders = async () => {};
 
 const createOrder = async (orderBody) => {

[Timeout] BlockStatement
services/order.js:54:7
 };
 
 const getAllActiveOrders = async () => {
-  try {
-    return await Order.find({ status: 'active' })
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
-  } catch (error) {
+  try {} catch (error) {
     console.error('Помилка у сервісі getAllActiveOrders:', error);
     throw new Error('Не вдалося отримати активні замовлення');

[Timeout] MethodExpression
services/order.js:55:18
 
 const getAllActiveOrders = async () => {
   try {
-    return await Order.find({ status: 'active' })
-      .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
+    return await Order.find({
+  status: 'active'
+}).populate('items.menu_id', 'dishName price');
   } catch (error) {
     console.error('Помилка у сервісі getAllActiveOrders:', error);

[Timeout] StringLiteral
services/order.js:55:39
 
 const getAllActiveOrders = async () => {
   try {
-    return await Order.find({ status: 'active' })
+    return await Order.find({ status: "" })
       .populate('items.menu_id', 'dishName price')
       .sort({ createdAt: -1 });

[Timeout] StringLiteral
services/order.js:56:17
 const getAllActiveOrders = async () => {
   try {
     return await Order.find({ status: 'active' })
-      .populate('items.menu_id', 'dishName price')
+      .populate("", 'dishName price')
       .sort({ createdAt: -1 });
   } catch (error) {

[Timeout] ObjectLiteral
services/order.js:57:13
   try {
     return await Order.find({ status: 'active' })
       .populate('items.menu_id', 'dishName price')
-      .sort({ createdAt: -1 });
+      .sort({});
   } catch (error) {
     console.error('Помилка у сервісі getAllActiveOrders:', error);

[Timeout] BlockStatement
services/order.js:58:19
     return await Order.find({ status: 'active' })
       .populate('items.menu_id', 'dishName price')
       .sort({ createdAt: -1 });
-  } catch (error) {
-    console.error('Помилка у сервісі getAllActiveOrders:', error);
-    throw new Error('Не вдалося отримати активні замовлення');
-  }
+  } catch (error) {}
 };
 

[Timeout] StringLiteral
services/order.js:59:19
       .populate('items.menu_id', 'dishName price')
       .sort({ createdAt: -1 });
   } catch (error) {
-    console.error('Помилка у сервісі getAllActiveOrders:', error);
+    console.error("", error);
     throw new Error('Не вдалося отримати активні замовлення');
   }

[Timeout] LogicalOperator
services/order.js:67:7
 const createOrder = async (orderBody) => {
   const { customerName, items } = orderBody;
 
-  if (!customerName || !items || items.length === 0) {
+  if ((!customerName || !items) && items.length === 0) {
     const err = new Error('Потрібні ім’я клієнта та позиції замовлення.');
     err.statusCode = 400;

[Timeout] ConditionalExpression
services/order.js:67:7
 const createOrder = async (orderBody) => {
   const { customerName, items } = orderBody;
 
-  if (!customerName || !items || items.length === 0) {
+  if (false) {
     const err = new Error('Потрібні ім’я клієнта та позиції замовлення.');
     err.statusCode = 400;

[Timeout] StringLiteral
services/order.js:68:27
   const { customerName, items } = orderBody;
 
   if (!customerName || !items || items.length === 0) {
-    const err = new Error('Потрібні ім’я клієнта та позиції замовлення.');
+    const err = new Error("");
     err.statusCode = 400;
     throw err;

[Timeout] ArrowFunction
services/order.js:72:29
     err.statusCode = 400;
     throw err;
   }
-  const menuIds = items.map((item) => item.menu_id);
+  const menuIds = items.map(() => undefined);
   const menuItems = await Dish.find({ _id: { $in: menuIds } });
   const menuMap = new Map(menuItems.map((dish) => [dish._id, dish]));

[Timeout] ObjectLiteral
services/order.js:73:44
     throw err;
   }
   const menuIds = items.map((item) => item.menu_id);
-  const menuItems = await Dish.find({ _id: { $in: menuIds } });
+  const menuItems = await Dish.find({ _id: {} });
   const menuMap = new Map(menuItems.map((dish) => [dish._id, dish]));
 

[Timeout] ArrowFunction
services/order.js:74:41
   }
   const menuIds = items.map((item) => item.menu_id);
   const menuItems = await Dish.find({ _id: { $in: menuIds } });
-  const menuMap = new Map(menuItems.map((dish) => [dish._id, dish]));
+  const menuMap = new Map(menuItems.map(() => undefined));
 
   let totalPrice = 0;

[Timeout] ArrayDeclaration
services/order.js:77:22
   const menuMap = new Map(menuItems.map((dish) => [dish._id, dish]));
 
   let totalPrice = 0;
-  const orderItems = [];
+  const orderItems = ["Stryker was here"];
   for (const item of items) {
     const menuItem = menuMap.get(item.menu_id);

[Timeout] BlockStatement
services/order.js:78:29
 
   let totalPrice = 0;
   const orderItems = [];
-  for (const item of items) {
-    const menuItem = menuMap.get(item.menu_id);
-    if (!menuItem) {
-      const err = new Error(`Страва з ID ${item.menu_id} не знайдена.`);
-      err.statusCode = 404;
-      throw err;
-    }
-    totalPrice += menuItem.price * item.quantity;
-    orderItems.push({ menu_id: item.menu_id, quantity: item.quantity });
-  }
+  for (const item of items) {}
   const newOrder = {
     _id: nanoid(),

[Timeout] ConditionalExpression
services/order.js:80:9
   const orderItems = [];
   for (const item of items) {
     const menuItem = menuMap.get(item.menu_id);
-    if (!menuItem) {
+    if (true) {
       const err = new Error(`Страва з ID ${item.menu_id} не знайдена.`);
       err.statusCode = 404;

[Timeout] ConditionalExpression
services/order.js:80:9
   const orderItems = [];
   for (const item of items) {
     const menuItem = menuMap.get(item.menu_id);
-    if (!menuItem) {
+    if (false) {
       const err = new Error(`Страва з ID ${item.menu_id} не знайдена.`);
       err.statusCode = 404;

[Timeout] AssignmentOperator
services/order.js:85:5
       err.statusCode = 404;
       throw err;
     }
-    totalPrice += menuItem.price * item.quantity;
+    totalPrice -= menuItem.price * item.quantity;
     orderItems.push({ menu_id: item.menu_id, quantity: item.quantity });
   }

[Timeout] ArithmeticOperator
services/order.js:85:19
       err.statusCode = 404;
       throw err;
     }
-    totalPrice += menuItem.price * item.quantity;
+    totalPrice += menuItem.price / item.quantity;
     orderItems.push({ menu_id: item.menu_id, quantity: item.quantity });
   }

[Timeout] BlockStatement
services/order.js:100:57
   return Order.create(newOrder);
 };
 
-const updateOrderStatus = async (orderId, newStatus) => {
-  if (!newStatus || !['active', 'completed'].includes(newStatus)) {
-    const err = new Error('Недійсний статус. Можливі: "active", "completed".');
-    err.statusCode = 400;
-    throw err;
-  }
-  const updatedOrder = await Order.findByIdAndUpdate(orderId, { status: newStatus }, { new: true });
-
-  if (!updatedOrder) {
-    const err = new Error('Активне замовлення не знайдено.');
-    err.statusCode = 404;
-    throw err;
-  }
-  return updatedOrder;
-};
+const updateOrderStatus = async (orderId, newStatus) => {};
 
 const deleteOrder = async (orderId) => {

[Timeout] ConditionalExpression
services/order.js:101:7
 };
 
 const updateOrderStatus = async (orderId, newStatus) => {
-  if (!newStatus || !['active', 'completed'].includes(newStatus)) {
+  if (false) {
     const err = new Error('Недійсний статус. Можливі: "active", "completed".');
     err.statusCode = 400;

[Timeout] BooleanLiteral
services/order.js:101:21
 };
 
 const updateOrderStatus = async (orderId, newStatus) => {
-  if (!newStatus || !['active', 'completed'].includes(newStatus)) {
+  if (!newStatus || ['active', 'completed'].includes(newStatus)) {
     const err = new Error('Недійсний статус. Можливі: "active", "completed".');
     err.statusCode = 400;

[Timeout] BooleanLiteral
services/order.js:106:93
     err.statusCode = 400;
     throw err;
   }
-  const updatedOrder = await Order.findByIdAndUpdate(orderId, { status: newStatus }, { new: true });
+  const updatedOrder = await Order.findByIdAndUpdate(orderId, { status: newStatus }, { new: false });
 
   if (!updatedOrder) {

[Timeout] ConditionalExpression
services/order.js:108:7
   }
   const updatedOrder = await Order.findByIdAndUpdate(orderId, { status: newStatus }, { new: true });
 
-  if (!updatedOrder) {
+  if (false) {
     const err = new Error('Активне замовлення не знайдено.');
     err.statusCode = 404;

[Timeout] BooleanLiteral
services/order.js:108:7
   }
   const updatedOrder = await Order.findByIdAndUpdate(orderId, { status: newStatus }, { new: true });
 
-  if (!updatedOrder) {
+  if (updatedOrder) {
     const err = new Error('Активне замовлення не знайдено.');
     err.statusCode = 404;

[Timeout] BlockStatement
services/order.js:116:40
   return updatedOrder;
 };
 
-const deleteOrder = async (orderId) => {
-  const deletedOrder = await Order.findOneAndDelete({
-    _id: orderId,
-    status: 'completed',
-  });
-
-  if (!deletedOrder) {
-    const err = new Error(
-      'Замовлення не знайдено або не має статусу "completed".'
-    );
-    err.statusCode = 404;
-    throw err;
-  }
-};
+const deleteOrder = async (orderId) => {};
 
 export default {

[Timeout] ConditionalExpression
services/order.js:122:7
     status: 'completed',
   });
 
-  if (!deletedOrder) {
+  if (false) {
     const err = new Error(
       'Замовлення не знайдено або не має статусу "completed".'

[Timeout] BlockStatement
services/order.js:122:22
     status: 'completed',
   });
 
-  if (!deletedOrder) {
-    const err = new Error(
-      'Замовлення не знайдено або не має статусу "completed".'
-    );
-    err.statusCode = 404;
-    throw err;
-  }
+  if (!deletedOrder) {}
 };
 

[Timeout] ObjectLiteral
services/order.js:131:16
   }
 };
 
-export default {
-  getAllHistory,
-  getPopularDishes,
-  getAllActiveOrders,
-  createOrder,
-  updateOrderStatus,
-  deleteOrder,
-};
+export default {};
 
